[
  {"title": "Chapitre 1 - Hello Linux World",
    "desc": "Voici donc ce premier chapitre qui aborde certains concepts fondamentaux de l'informatique, du web et de Linux, le système d'exploitation que nous utiliserons durant la formation. Un chapitre assez large donc, puisque vous trouverez l'histoire des ordinateurs, la différence entre web et internet et de la documentation/tutoriel sur la ligne de commande Linux. <br> La ligne de commande Linux sera au coeur de la formation, essayez de vous faire la main sur les instructions les plus courantes. Passez quelques heures à faire les tutoriels proposés dans la section exercice (ou trouvez en de nouveaux ceux-la ne vous conviennent pas.) <br> Si vous n'êtes pas sous Linux, essayez d'installer un OS Linux sur votre ordinateur (voir la partie Activité). Si çà vous fait peur, aucune obligation, concentrez-vous alors sur les tutoriels OpenClassrooms.<br> Pour information, le chapitre 2 sortira lundi 15 mars et abordera le développement web <br> Lisez avec passion !<br>"
  },
  {"title": "Chapitre 2 - Le HTML et l'ergnomie d'un site web",
    "desc": "Après l'installation de Linux, le principal sujet de ce chapitre est le language HTML (et le CSS). Celui qui permet de lire des informations sur <s>Firefox</s> votre navigateur favori. Pour ceux qui commencent, il faut voir le HMTL comme un format d'impression, comme si l'on convertissait un .doc (modifiable dans Microsoft Word) en un .pdf (figé pour etre imprimé aux collègues). La programmation web dépend entièrement du rendu final en html. Ce chapitre n'aborde pas (encore) la programmation, juste le rendu final, l'aspect du site.<br> Plus largement certains développeurs se sont spécialisés dans ce dommaine : graphisme, user experience (UX), user interface (UI), responsive design, autant de notions très différentes dont l'on discutera durant la formation.<br> Ce chapitre aborde donc deux sujets différents mais liés : le HTML/CSS et l'ergonomie. Non pas QUELLE information afficher sur son site, mais plutot COMMENT les afficher.<br> L'objectif de ce chapitre est donc d'arriver à la rentrée en maitrisant le HTML (pas parfaitement, pas par coeur, mais être capable de s'y retrouver facilement dans un fichier.html) et de comprendre pourquoi l'ergonomie est importante dans le développement web.<br> Attention les exercices sont plutot pistes verte-bleue alors que les articles sont plus pistes rouge-noire. Si vous êtes perdu, ne vous noyez pas dans la lecture et concentrez-vous sur les exercices."
  },
  {"title": "Chapitre 3 - Programmer",
    "desc": "Ce chapitre est assez abstrait, puisque son sujet n'est autre que la programmation.<br> La programamtion c'est donner des instructions, des recettes. Tout comme en cuisine, le programmeur écrit le livre de recettes et notre application sera le cuisinier qui appliquera une recette. Mais avant de pouvoir faire cela, c'est à dire utiliser un framework web pour créer de recettes à servir dans un restaurant (aka un site web), il faut apprendre à cuisiner ! Mais forcément apprendre à cuisiner dans l'objectif d'ouvrir un restaurant, c'est très loin, très abstrait ! 'Pourquoi j'apprends à couper des tomates, alors que je veux servir ma sauce bolognaise à mon client.' Bien sur vous pouvez acheter votre bolo au supermarché et la servir directement, mais quand on coupe ses tomates cela à tout de meme plus de gout.<br> Je détaille cet exemple pour faire comprendre que les exercices de ce chapitre peuvent sembler très éloigné de notre objectif d'application web, très abstrait. Mais apprendre un language est indispensable pour pouvoir créer un site web.<br> Ce chapitre contiendra donc toute une longue série d'exercices de différents niveaux pour apprendre principalement Ruby et Javascript (et un peu Python). <br> Mais le chapitre contient aussi des ressources plus simples, comme des jeux très graphiques pour comprendre comment programmer ou sur l'initiation à aux algorithmes (la recette d'instruction). Ce chapitre peut faire un peu peur à certains, allez sereinement à votre rythme, on sera là pour tout réexpliquer pas à pas à la rentrée !"
  },
  {"title": "Chapitre 4 - Le travail collaboratif : workflow et partage",
    "desc": ""
  }
]